In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r'C:\Users\ASUS\Downloads\StudentsPerformance.csv')

In [3]:
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

# Question 1

Find out how many males and females participated in the test.

In [4]:
data.value_counts('gender')

gender
female    518
male      482
dtype: int64

# Question 2 

What do you think about the students' parental level of education?

In [5]:
data.value_counts('parental level of education')

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
dtype: int64

# Question 3

In [11]:
scores_avg  = data.groupby(['gender','test preparation course'])['math score','reading score','writing score']
scores_avg

C:\Users\ASUS\AppData\Local\Temp\ipykernel_15696\1975020301.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  scores_avg  = data.groupby(['gender','test preparation course'])['math score','reading score','writing score']

# Question 4

In [7]:
gender_var = data[['gender','math score','reading score','writing score']].groupby('gender').std()
gender_var

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [8]:
test_var = data[['test preparation course','math score','reading score','writing score']].groupby('test preparation course').std()
test_var

                         math score  reading score  writing score
test preparation course
completed                 14.521847      13.537572      13.236412
none                      15.705689      14.608896      15.041667

# Question 5

In [9]:
data.nlargest(250,['math score'])

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
515,female,group E,some college,standard,none,100,92,97
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
428,female,group D,some college,free/reduced,none,77,86,86
429,female,group E,some high school,standard,none,77,79,80
849,male,group A,bachelor's degree,standard,none,77,67,68
850,male,group C,associate's degree,free/reduced,none,77,67,64
851,male,group D,some college,standard,completed,77,62,62